In [2]:
load_ext sql

In [3]:
%%sql 
mysql+pymysql://instructor:password@localhost/
drop database if exists lecture2;
create database lecture2;
use lecture2;

2 rows affected.
1 rows affected.
0 rows affected.

[]

# Lecture 2b

First, let's recreate the instructor table -- this time with no foreign key.

In [4]:
%%sql 
drop table if exists instructor;
create table instructor (
    ID         char(5),
    name       varchar(20) not null,
    dept_name  varchar(20),
    salary     numeric(8,2),
    primary key (ID)
);

 * mysql+pymysql://instructor:***@localhost/
0 rows affected.
0 rows affected.

/usr/local/lib/python3.7/site-packages/pymysql/cursors.py:170: Warning: (1051, "Unknown table 'lecture2.instructor'")
  result = self._query(query)

[]

# Show Tuples

In [5]:
%%sql 
select * from instructor;

 * mysql+pymysql://instructor:***@localhost/
0 rows affected.

[]

# Updates to Tables

## Insert

```sql
insert into instructor values (‘10211’, ’Smith’, ’Biology’, 66000);
```

In [6]:
%%sql 
insert into instructor (ID, name, dept_name, salary) values ('10211', 'Smith', 'Biology', 66000);

 * mysql+pymysql://instructor:***@localhost/
1 rows affected.

[]

In [7]:
%%sql 
select * from instructor;

 * mysql+pymysql://instructor:***@localhost/
1 rows affected.

[('10211', 'Smith', 'Biology', Decimal('66000.00'))]

## Delete

Remove all tuples from the a relation

`delete from <table>`

In [8]:
%%sql 
delete from instructor;

 * mysql+pymysql://instructor:***@localhost/
1 rows affected.

[]

In [9]:
%%sql 
select * from instructor;

 * mysql+pymysql://instructor:***@localhost/
0 rows affected.

[]

## Delete Table

In [10]:
%%sql 
drop table instructor;

 * mysql+pymysql://instructor:***@localhost/
0 rows affected.

[]

In [11]:
%%sql 
create table department (
     dept_name varchar(20),
     primary key (dept_name)
);

 * mysql+pymysql://instructor:***@localhost/
0 rows affected.

[]

In [12]:
%%sql 
desc department;

 * mysql+pymysql://instructor:***@localhost/
1 rows affected.

[('dept_name', 'varchar(20)', 'NO', 'PRI', None, '')]

## Alter

## Adding an Attribute 

alter table r add A D;

In [13]:
%%sql 
alter table department add ID char(3);

 * mysql+pymysql://instructor:***@localhost/
0 rows affected.

[]

In [14]:
%%sql 
desc department;

 * mysql+pymysql://instructor:***@localhost/
2 rows affected.

[('dept_name', 'varchar(20)', 'NO', 'PRI', None, ''),
 ('ID', 'char(3)', 'YES', '', None, '')]

## Dropping an Attribute 

alter table r drop A;

* where A is the name of an attribute in relation _r_
* Dropping of attributes is not supported by some databases

In [15]:
%%sql 
alter table department drop ID;

 * mysql+pymysql://instructor:***@localhost/
0 rows affected.

[]

In [16]:
%%sql 
desc department;

 * mysql+pymysql://instructor:***@localhost/
1 rows affected.

[('dept_name', 'varchar(20)', 'NO', 'PRI', None, '')]

# Basic Query Structure

*  A typical SQL query has the form:

```mysql
select A1, A2, ..., An
from r1, r2..., rn
where P
```

* Ai represents an attribute
* Ri represents a relation
* P is a predicate

* The result of a SQL query is... a relation.

### Example

First, let's recreate the instructor table and add some tuples.

In [21]:
%%sql 
drop table if exists instructor;
create table instructor (
    ID         char(5),
    name       varchar(20) not null,
    dept_name  varchar(20),
    salary     numeric(8,2),
    primary key (ID)
);

 * mysql+pymysql://instructor:***@localhost/
0 rows affected.
0 rows affected.

[]

In [22]:
%%sql 
insert into instructor (ID, name, dept_name, salary) values ('10211', 'Smith', 'Biology', 50000);
insert into instructor (ID, name, dept_name, salary) values ('10212', 'Yusuf', 'Mathematics', 55000);
insert into instructor (ID, name, dept_name, salary) values ('10213', 'Asma', 'Mathematics', 60000);
insert into instructor (ID, name, dept_name, salary) values ('10214', 'Thomas', 'Literature', 65000);

 * mysql+pymysql://instructor:***@localhost/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

Now, let's query for instructor names:

In [23]:
%%sql
select name 
from instructor;

 * mysql+pymysql://instructor:***@localhost/
4 rows affected.

[('Smith',), ('Yusuf',), ('Asma',), ('Thomas',)]

Now, let's add a predicate:

In [26]:
%%sql 
select name from instructor where salary > 55000;

 * mysql+pymysql://instructor:***@localhost/
2 rows affected.

[('Asma',), ('Thomas',)]